package students.dmitrijs_matrenicevs.lesson_9.level_1.task_1;

public class Plane {

    protected Plane(){

    }

    //Я думаю больше всего тут подойдет Protected, хотя и Public тоже вполне подходит )

    /*
    *public - публичный, общедоступный класс или член класса.
    * Поля и методы, объявленные с модификатором public, видны другим классам из текущего
    * пакета и из внешних пакетов.
    *
    *private - закрытый класс или член класса, противоположность модификатору public.
    *Закрытый класс или член класса доступен только из кода в том же классе.
    *
    *protected - такой класс или член класса доступен из любого места в текущем классе или пакете или в производных классах,
    * даже если они находятся в других пакетах
    */
}
