package students.vija_m.lesson_10.level_1.task_3;

interface SimpleList {
    //добавить в определённок место списка новый элемент
    //удалить элемент из определённого места списка
    // удалить первый элемент в списке имеющий заданное значение
    //удалить из списка все элементы с заданным значением
    // увеличить заданную длинну (размер) списка
    // уменьшить заданную длинну (размер) списка
    // вывести все значения из заданного интервала в отдельный список
// list.reverse() отобразить весь список в обратном порядке
}
